leandroschwarz/funsapeLib/_stuff/old_projects/STM32_central_80/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2018 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f0xx_hal.h"
#include "adc.h"
#include "dma.h"
#include "i2c.h"
#include "spi.h"
#include "tim.h"
#include "usart.h"
#include "gpio.h"
#include "setup.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin GPIO_PIN_13
#define B1_GPIO_Port GPIOC
#define ADC_STEE_Pin GPIO_PIN_0
#define ADC_STEE_GPIO_Port GPIOC
#define ADC_BRAK_Pin GPIO_PIN_1
#define ADC_BRAK_GPIO_Port GPIOC
#define ADC_ACCE_Pin GPIO_PIN_2
#define ADC_ACCE_GPIO_Port GPIOC
#define ADC_FRSU_Pin GPIO_PIN_3
#define ADC_FRSU_GPIO_Port GPIOC
#define USART4_TX_GPS_Pin GPIO_PIN_0
#define USART4_TX_GPS_GPIO_Port GPIOA
#define USART4_RX_GPS_Pin GPIO_PIN_1
#define USART4_RX_GPS_GPIO_Port GPIOA
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define CHANNEL_1_Pin GPIO_PIN_5
#define CHANNEL_1_GPIO_Port GPIOA
#define CHANNEL_2_Pin GPIO_PIN_6
#define CHANNEL_2_GPIO_Port GPIOA
#define CHANNEL_3_Pin GPIO_PIN_7
#define CHANNEL_3_GPIO_Port GPIOA
#define ADC_FLSU_Pin GPIO_PIN_4
#define ADC_FLSU_GPIO_Port GPIOC
#define ADC_BATT_Pin GPIO_PIN_5
#define ADC_BATT_GPIO_Port GPIOC
#define USART3_TX_MATR_Pin GPIO_PIN_11
#define USART3_TX_MATR_GPIO_Port GPIOB
#define EXTINT_INJE_Pin GPIO_PIN_7
#define EXTINT_INJE_GPIO_Port GPIOC
#define EXTINT_FRHA_Pin GPIO_PIN_8
#define EXTINT_FRHA_GPIO_Port GPIOC
#define EXTINT_FLHA_Pin GPIO_PIN_9
#define EXTINT_FLHA_GPIO_Port GPIOC
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define USART3_RX_MATR_Pin GPIO_PIN_10
#define USART3_RX_MATR_GPIO_Port GPIOC
#define USART5_TX_INJE_Pin GPIO_PIN_12
#define USART5_TX_INJE_GPIO_Port GPIOC
#define USART5_RX_INJE_Pin GPIO_PIN_2
#define USART5_RX_INJE_GPIO_Port GPIOD
#define USART1_TX_SENS_Pin GPIO_PIN_6
#define USART1_TX_SENS_GPIO_Port GPIOB
#define USART1_RX_SENS_Pin GPIO_PIN_7
#define USART1_RX_SENS_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
